
/* »—д«гћ н” ќ—ћ «б√—ё«г «бЁ—ѕн… гд гѕм гЏнд ж нћгЏе« гЋб« гд 1 Ќ м 100
ж н” ќ—ћ «б√—ё«г «б“жћн… ж нћгЏе«
*/
#include <iostream>
using namespace std;


int main()
{
    int sumx=0;
    int sumy=0;
    cout<<"        Odd     " <<"   Even"<<endl;

    for(int x=-1; x<10 ; x+2)

    {


        for(int y=0 ; y<10 ; y+2)
        {
            x +=2;
            y +=2;
//-------------------------------------------------
         cout <<"         "<<x << "          " <<y<<endl;
//-------------------------------------------------

          sumx = sumx + x;
          sumy = sumy + y;
//------------------------------------------------
      }

    cout<<"        ____"<<"       ____"<<endl;
    cout << "\n" <<"Sum     "   <<sumx;
    cout <<"         "   <<sumy <<endl;
    return 0;
}

}
